10/data/attachments/a59c81e2b41ff23a.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_93ff4070-cf5c-40b5-82d5-9452476aa2ca</nif:username>
            <nif:friendToBeAdded>Amanda_owner_Friend_51282_8</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>